namespace TradeDocsV3.Models;

public enum DataContextRole
{
    None,

    // --- ДОВІДНИКИ ---
    Номенклатура,
    Контрагенти,
    Працівники,
    Магазини,
    ОдиниціВиміру,

    // --- ДОКУМЕНТИ (ШАПКИ) ---
    Замовлення,
    Повернення,
    Прихід,               // Прихід товару
    Специфікація,         // Специфікація постачальника

    // --- ТАБЛИЧНІ ЧАСТИНИ (РЯДКИ) ---
    Замовлення_Товари,
    Повернення_Товари,
    Прихід_Товари,
    Специфікація_Товари,

    // --- РЕГІСТРИ ---
    РегістрЦін
}