namespace TradeDocsV3.Models;

public enum DataContextType
{
    Невизначено,

    /// <summary>
    /// Довідники (Номенклатура, Контрагенти...).
    /// Зазвичай мають Id та Name.
    /// </summary>
    Довідник,

    /// <summary>
    /// Шапки документів (Замовлення, Прихід...).
    /// Зазвичай мають Номер, Дату, Суму, Контрагента.
    /// </summary>
    Документ,

    /// <summary>
    /// Рядки товарів у документі.
    /// Мають посилання на документ (DocumentId), Товар, Кількість, Ціну.
    /// </summary>
    ТабличнаЧастина,

    /// <summary>
    /// Регістри (Ціни, Штрихкоди).
    /// Мають специфічний набір полів.
    /// </summary>
    Регістр
}